/*Напишите программу с тремя переменными целого типа, первым двум присвойте значения,
а третьей переменной присвойте их сумму. Выведете значение третей переменной на экран.*/
package lesson1Homework;

public class Task10 {
    public static void main(String[] args) {
        int firstNum = 3;
        int secondNum = 7;
        int sum = firstNum + secondNum;
        System.out.println(sum);
    }
}
