/*Напишите метод переводящий рубли в доллары по заданному курсу.
В качестве аргументов укажите кол-во рублей и курс.*/
package lesson_1_Homework;

public class Task18 {
    public static void main(String[] args) {
        double rubles = 65.4;
        double exchangeRate = 124.01;
        System.out.println(rubles / exchangeRate);
    }
}
