/*Напишите программу с тремя переменными целого типа, первым двум присвойте значения,
а третьей переменной присвойте их сумму. Выведете значение третей переменной на экран.*/
package lesson1;

public class Task10 {
    public static void main(String[] args) {
        int a = 3;
        int b = 7;
        int sum = a + b;
        System.out.println(sum);
    }
}
