//Вывести на  экран все четные цифры от 1 до 100 не используя остаток от деления (используя только цикл for)
package lesson1;

public class Task6 {
    public static void main(String[] args) {
        for (int i = 0; i <= 100; i += 2)
            System.out.println(i);
    }
}
